---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionTypeId
source: html/526b1805-5ccf-4625-13c6-50d10d40761b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionTypeId Property

"Angular Dimension Style"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeAngularDimensionTypeId { get; }
```